#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/diogoleal/crispy-succotash/runs/run-dnKwWsHiwdxKPh31

Waiting for the plan to start...

Terraform v1.1.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_placement_group.web: Refreshing state... [id=k8s]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f89ef7a992256aea]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a6e4f24bbe0703d8]
aws_kms_key.this: Refreshing state... [id=5c1a2407-4a55-4b81-b12e-3728a5f87a56]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e42472939eefad29]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0e69e7484e89d4539]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05e0c406ea5410ed5]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06d0b78134a1357b7]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-080134437917b0c38]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0212f1e4f0ac681d7]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-069947b3c99f15255]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-018dadbf2b7d6fce6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00153f9dbe402f3bd]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0eab2321587ed32a3]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-051a25c47ee2103b1]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0c90d20199e8527df]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06aba10313d0f5571]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0cbe4173cd5afe576]
module.rancher_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0a8a2181b96487abe]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00153f9dbe402f3bd1080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0898da4179694a47c]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-04c155b780849e2bd]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e692c8fea0aeab52]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cca0c749829cbc49]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-09dd937c1d68c19d4]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0dfd4df39a0d6dd62]
aws_network_interface.this: Refreshing state... [id=eni-02f05f979c4e17df1]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-049f0941022d68b5e]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-08681c37c57d512f6]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-01b8111fa5e5ef341]
module.ec2_instance.aws_instance.this[0]: Refreshing state... [id=i-0db33e3c78a49533b]
module.rancher_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2718776257]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06aba10313d0f55711080289494]
module.rancher_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1072757757]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-0cbe4173cd5afe5761080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0c90d20199e8527df1080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.rancher_security_group.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
        id                     = "sg-0a8a2181b96487abe"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All protocols"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
            # (1 unchanged element hidden)
        ]
        name                   = "k8s-20211212045650053900000001"
        tags                   = {
            "Environment" = "dev"
            "Name"        = "k8s"
            "Project"     = "comics"
            "Terraform"   = "true"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rancher_security_group.aws_security_group_rule.ingress_rules[0] has changed
  ~ resource "aws_security_group_rule" "ingress_rules" {
      ~ from_port         = -1 -> 0
        id                = "sgrule-2718776257"
      ~ to_port           = -1 -> 0
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ec2_instance.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:899903244877:instance/i-0db33e3c78a49533b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0db33e3c78a49533b" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-094eb7bd2c609344f" -> (known after apply)
      ~ private_dns                          = "ip-10-0-101-163.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.101.163" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "54.81.2.221" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Environment" = "dev"
            "Name"        = "rancher"
            "Project"     = "comics"
            "Terraform"   = "true"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      ~ user_data_base64                     = "IyEvYmluL2Jhc2gKCmVjaG8gIkhlbGxvIFRlcnJhZm9ybSEiCg==" -> "IyEvYmluL2Jhc2gKeXVtIGluc3RhbGwgZG9ja2VyIC15Ci9ldGMvaW5pdC5kL2RvY2tlciBzdGFydApkb2NrZXIgcnVuIC1kIC0tbmFtZSByYW5jaGVyIC0tcmVzdGFydD11bmxlc3Mtc3RvcHBlZCAtdiAvb3B0L3JhbmNoZXI6L3Zhci9saWIvcmFuY2hlciAgLXAgODA6ODAgLXAgNDQzOjQ0MyByYW5jaGVyL3JhbmNoZXI6djIuNC4zCg==" # forces replacement
        # (12 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      ~ credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }


      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-00cde831e7e392795" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @diogoleal, Action: `pull_request`*